# IFCProperty Mapping Info Revit Property Name Property

Source: https://www.revitapidocs.com/2026/adefaa40-eff2-14b1-70c3-822d8a84e9e5.htm

---

| IFCProperty Mapping Info Revit Property Name Property |
| --- |

The Revit property name.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string RevitPropertyName { get; set; }
```

```
Public Property RevitPropertyName As String
	Get
	Set
```

```
public:
property String^ RevitPropertyName {
	String^ get ();
	void set (String^ value);
}
```

```
member RevitPropertyName : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace